PTSolns/PTSolnsCore/avr-1.8.6/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.cpu=Processor

##############################################################

uno.name=PTSolns Uno R3+     [Supporting Materials](https://github.com/PTSolns/docs/tree/main/Products/PTS-00194_Uno_R3_Plus)   [Buy this Board](https://ptsolns.com/products/uno-r3)




uno.vid.0=0x2341
uno.pid.0=0x0043
uno.vid.1=0x2341
uno.pid.1=0x0001
uno.vid.2=0x2A03
uno.pid.2=0x0043
uno.vid.3=0x2341
uno.pid.3=0x0243
uno.vid.4=0x2341
uno.pid.4=0x006A
uno.upload_port.0.vid=0x2341
uno.upload_port.0.pid=0x0043
uno.upload_port.1.vid=0x2341
uno.upload_port.1.pid=0x0001
uno.upload_port.2.vid=0x2A03
uno.upload_port.2.pid=0x0043
uno.upload_port.3.vid=0x2341
uno.upload_port.3.pid=0x0243
uno.upload_port.4.vid=0x2341
uno.upload_port.4.pid=0x006A
uno.upload_port.5.board=uno

uno.upload.tool=avrdude
uno.upload.tool.default=avrdude
uno.upload.tool.network=arduino_ota
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.maximum_data_size=2048
uno.upload.speed=115200

uno.bootloader.tool=avrdude
uno.bootloader.tool.default=avrdude
uno.bootloader.low_fuses=0xFF
uno.bootloader.high_fuses=0xDE
uno.bootloader.extended_fuses=0xFD
uno.bootloader.unlock_bits=0x3F
uno.bootloader.lock_bits=0x0F
uno.bootloader.file=optiboot/optiboot_atmega328.hex

uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.board=AVR_UNO
uno.build.core=arduino
uno.build.variant=standard

##############################################################

unokit.name=PTSolns DIY UNO Kit    [Supporting Materials](https://github.com/PTSolns/docs/tree/main/Products/PTS-00197_DIY_UNO_Kit)   [Buy this Board](https://ptsolns.com/products/diy-uno-kit)



unokit.vid.0=0x2341
unokit.pid.0=0x0043
unokit.vid.1=0x2341
unokit.pid.1=0x0001
unokit.vid.2=0x2A03
unokit.pid.2=0x0043
unokit.vid.3=0x2341
unokit.pid.3=0x0243
unokit.vid.4=0x2341
unokit.pid.4=0x006A
unokit.upload_port.0.vid=0x2341
unokit.upload_port.0.pid=0x0043
unokit.upload_port.1.vid=0x2341
unokit.upload_port.1.pid=0x0001
unokit.upload_port.2.vid=0x2A03
unokit.upload_port.2.pid=0x0043
unokit.upload_port.3.vid=0x2341
unokit.upload_port.3.pid=0x0243
unokit.upload_port.4.vid=0x2341
unokit.upload_port.4.pid=0x006A
unokit.upload_port.5.board=uno

unokit.upload.tool=avrdude
unokit.upload.tool.default=avrdude
unokit.upload.tool.network=arduino_ota
unokit.upload.protocol=arduino
unokit.upload.maximum_size=32256
unokit.upload.maximum_data_size=2048
unokit.upload.speed=115200

unokit.bootloader.tool=avrdude
unokit.bootloader.tool.default=avrdude
unokit.bootloader.low_fuses=0xFF
unokit.bootloader.high_fuses=0xDE
unokit.bootloader.extended_fuses=0xFD
unokit.bootloader.unlock_bits=0x3F
unokit.bootloader.lock_bits=0x0F
unokit.bootloader.file=optiboot/optiboot_atmega328.hex

unokit.build.mcu=atmega328p
unokit.build.f_cpu=16000000L
unokit.build.board=AVR_UNO
unokit.build.core=arduino
unokit.build.variant=standard

##############################################################

nano.name=PTSolns Nano Flip    [Supporting Materials](https://github.com/PTSolns/docs/tree/main/Products/PTS-00195_Nano_Flip)   [Buy this Board](https://ptsolns.com/products/nano-flip)



nano.upload_port.0.board=nano

nano.upload.tool=avrdude
nano.upload.tool.default=avrdude
nano.upload.tool.network=arduino_ota
nano.upload.protocol=arduino

nano.bootloader.tool=avrdude
nano.bootloader.tool.default=avrdude
nano.bootloader.unlock_bits=0x3F
nano.bootloader.lock_bits=0x0F

nano.build.f_cpu=16000000L
nano.build.board=AVR_NANO
nano.build.core=arduino
nano.build.variant=eightanaloginputs

## Arduino Nano w/ ATmega328P
## --------------------------
nano.menu.cpu.atmega328=ATmega328P

nano.menu.cpu.atmega328.upload.maximum_size=30720
nano.menu.cpu.atmega328.upload.maximum_data_size=2048
nano.menu.cpu.atmega328.upload.speed=115200

nano.menu.cpu.atmega328.bootloader.low_fuses=0xFF
nano.menu.cpu.atmega328.bootloader.high_fuses=0xDA
nano.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
nano.menu.cpu.atmega328.bootloader.file=optiboot/optiboot_atmega328.hex

nano.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino Nano w/ ATmega328P (old bootloader)
## --------------------------
nano.menu.cpu.atmega328old=ATmega328P (Old Bootloader)

nano.menu.cpu.atmega328old.upload.maximum_size=30720
nano.menu.cpu.atmega328old.upload.maximum_data_size=2048
nano.menu.cpu.atmega328old.upload.speed=57600

nano.menu.cpu.atmega328old.bootloader.low_fuses=0xFF
nano.menu.cpu.atmega328old.bootloader.high_fuses=0xDA
nano.menu.cpu.atmega328old.bootloader.extended_fuses=0xFD
nano.menu.cpu.atmega328old.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

nano.menu.cpu.atmega328old.build.mcu=atmega328p

## Arduino Nano w/ ATmega168
## -------------------------
nano.menu.cpu.atmega168=ATmega168

nano.menu.cpu.atmega168.upload.maximum_size=14336
nano.menu.cpu.atmega168.upload.maximum_data_size=1024
nano.menu.cpu.atmega168.upload.speed=19200

nano.menu.cpu.atmega168.bootloader.low_fuses=0xff
nano.menu.cpu.atmega168.bootloader.high_fuses=0xdd
nano.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
nano.menu.cpu.atmega168.bootloader.file=atmega/ATmegaBOOT_168_diecimila.hex

nano.menu.cpu.atmega168.build.mcu=atmega168

##############################################################

leonardo.name=PTSolns Leonardo+    [Supporting Materials](https://github.com/PTSolns/docs/tree/main/Products/PTS-00196_Leonardo_Plus)   [Buy this Board](https://ptsolns.com/products/leonardo)


leonardo.vid.0=0x2341
leonardo.pid.0=0x0036
leonardo.vid.1=0x2341
leonardo.pid.1=0x8036
leonardo.vid.2=0x2A03
leonardo.pid.2=0x0036
leonardo.vid.3=0x2A03
leonardo.pid.3=0x8036
leonardo.upload_port.0.vid=0x2341
leonardo.upload_port.0.pid=0x0036
leonardo.upload_port.1.vid=0x2341
leonardo.upload_port.1.pid=0x8036
leonardo.upload_port.2.vid=0x2A03
leonardo.upload_port.2.pid=0x0036
leonardo.upload_port.3.vid=0x2A03
leonardo.upload_port.3.pid=0x8036
leonardo.upload_port.4.board=leonardo

leonardo.upload.tool=avrdude
leonardo.upload.tool.default=avrdude
leonardo.upload.tool.network=arduino_ota
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.tool=avrdude
leonardo.bootloader.tool.default=avrdude
leonardo.bootloader.low_fuses=0xff
leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb
leonardo.bootloader.file=caterina/Caterina-Leonardo.hex
leonardo.bootloader.unlock_bits=0x3F
leonardo.bootloader.lock_bits=0x2F

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.usb_product="Arduino Leonardo"
leonardo.build.board=AVR_LEONARDO
leonardo.build.core=arduino
leonardo.build.variant=leonardo
leonardo.build.extra_flags={build.usb_flags}

##############################################################

pro.name=PTSolns Nano Flip 3V3    [Supporting Materials](https://github.com/PTSolns/docs/tree/main/Products/PTS-00195_Nano_Flip)   [Buy this Board](https://ptsolns.com/products/nano-flip-3v3)



pro.upload_port.0.board=pro

pro.upload.tool=avrdude
pro.upload.tool.default=avrdude
pro.upload.tool.network=arduino_ota
pro.upload.protocol=arduino

pro.bootloader.tool=avrdude
pro.bootloader.tool.default=avrdude
pro.bootloader.unlock_bits=0x3F
pro.bootloader.lock_bits=0x0F

pro.build.board=AVR_PRO
pro.build.core=arduino
pro.build.variant=eightanaloginputs

## Arduino Pro or Pro Mini (3.3V, 8 MHz) w/ ATmega328P
## ---------------------------------------------------

pro.upload.maximum_size=30720
pro.upload.maximum_data_size=2048
pro.upload.speed=57600

pro.bootloader.low_fuses=0xFF
pro.bootloader.high_fuses=0xDA
pro.bootloader.extended_fuses=0xFD
pro.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex

pro.build.mcu=atmega328p
pro.build.f_cpu=8000000L

##############################################################
